//*************************************************************************************************************
//イニシャルプログラムのファイルに関する関数
//*************************************************************************************************************

#pragma warning( disable: 4996 )       // コード先頭に記載

//標準ライブラリのインクルード
#include<stdio.h>
#include"イニシャル_定数・構造体定義.h"

//-------------------------------------------------------------------------------------------------------------
//入力ファイルを開く関数
//-------------------------------------------------------------------------------------------------------------
void Open_File_In(	FILE	**fp,		//出力ファイルポインタのポインタ
					char	*posit,		//入力ファイルのパス
					unsigned int		num ){		//イニシャルファイル番号

	//変数宣言---------------------------------------------------------------------------------------
	char	posit_num[256];		//入力ファイルのパスと番号をくっつけた文字列

	//入力フォルダパスとファイル番号をくっつけた文字列を作成--------------------------------------------
	sprintf( posit_num, "%s%03di.DAT", posit, num );

	if( (*fp = fopen(posit_num, "rb")) == NULL ){
		printf( "「%03di.DAT」は存在しません。\n", num );
		printf( "プログラムを終了してください。\n\n" );
		while(1);
	}else{
		printf("%s%03di.DAT\n", posit, num );
	}
}

//-------------------------------------------------------------------------------------------------------------
//出力ファイルを開く関数
//-------------------------------------------------------------------------------------------------------------
void Open_File_Out(	FILE	**fp_out,		//出力ファイルポインタのポインタ
					char	*posit_out,		//出力ファイルのパス
					unsigned int		num_init_0,		//イニシャルファイル番号0
					unsigned int		num_init_1){	//イニシャルファイル番号1

	//変数宣言---------------------------------------------------------------------------------------
	char	posit_num_out[256];		//出力ファイルのパスと番号をくっつけた文字列

	//入力フォルダパスとファイル番号をくっつけた文字列を作成--------------------------------------------
	sprintf(posit_num_out, "%s/%03di_%03di.txt", posit_out, num_init_0, num_init_1);
	*fp_out = fopen(posit_num_out, "w");
}

void Open_File_Out2( FILE	**fp_out,
				    char	*posit_out,
					unsigned int	num_init_2){
	char	posit_num_out[256];

	sprintf(posit_num_out, "%s/%03d_p_max.txt", posit_out, num_init_2);
	*fp_out = fopen(posit_num_out,"w");
}